---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalService.Name
source: html/dd73f984-ee0e-6e97-241f-53e4a62915e1.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalService.Name Property

The name of the service

## Syntax (C#)
```csharp
public string Name { get; }
```